perf/bbox/baseline-bbox0.yaml
config:
  environments:
    bbox0:
      target: 'http://localhost:5555/bbox0'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox"
    bbox1:
      target: 'http://localhost:5555/bbox1'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 600
      arrivalRate: 5
      rampTo: 300


scenarios:
  - name: Bbox0
    flow:
      - get:
          url: '/'