perf/bbox/explorative-stress-testing-bbox1-3.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    cluster:
      target: 'http://localhost:5555/node/cluster'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - duration: 60
      arrivalCount: 25
    - duration: 60
      arrivalCount: 50
    - duration: 60
      arrivalCount: 75
    - duration: 60
      arrivalCount: 100


scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/bbox/1'