perf/bbox/explorative-stress-testing-bbox1-4.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    cluster:
      target: 'http://localhost:5555/node/cluster'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - duration: 60
      arrivalCount: 100
    - duration: 60
      arrivalCount: 150
    - duration: 60
      arrivalCount: 200
    - duration: 60
      arrivalCount: 250
    - duration: 60
      arrivalCount: 300
    - duration: 60
      arrivalCount: 350
scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/bbox/1'