perf/bbox/explorative-stress-testing-bbox1-5.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    cluster:
      target: 'http://localhost:5555/node/cluster'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - duration: 60
      arrivalCount: 350
    - duration: 60
      arrivalCount: 400
    - duration: 60
      arrivalCount: 500
    - duration: 60
      arrivalCount: 600
    - duration: 60
      arrivalCount: 700
    - duration: 60
      arrivalCount: 800
    - duration: 60
      arrivalCount: 900
    - duration: 60
      arrivalCount: 1000
scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/bbox/1'